app/controllers/cases_controller.rb

  def index
    @cases = Case.all
---
SELECT "cases".* FROM "cases"