app/controllers/customers_controller.rb

SELECT "customers".* FROM "customers"
---
  def index
    @customers = Customer.all

INSERT INTO "customers" ("Name", "customerId", "PhoneNo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["Name", "test 1"], ["customerId", "001"], ["PhoneNo", "0871234567"], ["created_at", "2020-05-17 12:23:03.252303"], ["updated_at", "2020-05-17 12:23:03.252303"]]
---
  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save

DELETE FROM "customers" WHERE "customers"."id" = ?  [["id", 3]]
---
  def destroy
    @customer.destroy

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_customer
      @customer = Customer.find(params[:id])